[
  {
    "title": "Nancy Pelosi Enjoys Lady Gaga's \"Mayhem Ball\" from the Pit: \"The Most Fun I've Had in a Long Time\"",
    "description": "Nancy Pelosi attended Lady Gaga's \"Mayhem Ball\" in San Francisco,\" describing it as the \"most fun I've had in a long time.\"",
    "date": "2025-07-29 16:41:55",
    "image": null
  },
  {
    "title": "Lady Gaga Is a Star on the Stage in California, Plus Pamela Anderson, Liam Neeson, Lindsay Lohan, and More",
    "description": "Stars have been everywhere this week. In New York City, Lady Gaga brings her star energy to California during the Mayhem Ball Tour,...",
    "date": "2025-07-29 19:13:30",
    "image": null
  },
  {
    "title": "Nancy Pelosi Attends Lady Gaga’s Mayhem Ball With Floor Seats: ‘Most Fun I’ve Had in a Long Time’",
    "description": "Most days, Nancy Pelosi is one of the most powerful Democratic politicians in Congress. But at a recent Lady Gaga concert,...",
    "date": "2025-07-29 18:12:59",
    "image": null
  },
  {
    "title": "Lady Gaga Burns the (Opera) House Down with The Mayhem Ball Tour (Review)",
    "description": "Alex reports on his experience seeing Lady Gaga's Mayhem Ball Tour at T-Mobile Arena in Las Vegas, Nevada in July 2025.",
    "date": "2025-07-26 21:38:01",
    "image": null
  },
  {
    "title": "Lady Gaga Wore a Trans Flag Sash on the Mayhem Ball Tour",
    "description": "During Monday night's Los Angeles stop on her Mayhem Ball tour, Lady Gaga sported a sash with the colors of the transgender flag.",
    "date": "2025-07-29 17:17:10",
    "image": null
  },
  {
    "title": "Nancy Pelosi dances with fellow ‘little monsters’ at Lady Gaga show",
    "description": "Nancy Pelosi just might be a 'little monster.'Pelosi was spotted at Lady Gaga's concert in San Francisco and even posted about the...",
    "date": "2025-07-29 20:16:50",
    "image": null
  },
  {
    "title": "Live at Kia Forum in Los Angeles (Jul. 28 2025)",
    "description": "Gagaimages is the most updated and largest Lady Gaga gallery on the whole net.",
    "date": "2025-07-29 16:26:49",
    "image": null
  },
  {
    "title": "5 Surprising Facts About Lady Gaga’s ‘Born This Way’",
    "description": "Released on May 23, 2011, Born This Way bursts from the speakers like a gospel sermon inside a neon cathedral. Co-produced and co-written by...",
    "date": "2025-07-29 04:30:15",
    "image": null
  },
  {
    "title": "Lady Gaga wears trans pride flag as sash during Mayhem Ball performance",
    "description": "During a recent stop in California as part of her Mayhem Ball tour, Lady Gaga donned a sash in the colours of the transgender Pride flag.",
    "date": "2025-07-29 14:23:29",
    "image": null
  },
  {
    "title": "Nancy Pelosi says Lady Gaga’s S.F. concert was ‘the most fun I’ve had in a long time’",
    "description": "Nancy Pelosi praises Lady Gaga's San Francisco concert at Chase Center as “the most fun I've had in a long time.”",
    "date": "2025-07-29 06:00:49",
    "image": null
  }
]